{"pageProps":{"post":{"title":"Being the new guy","date":"2020-05-10T00:00:00.000Z","slug":"the-new-guy","content":"<p>It's been 3 months since I started my first full-time job as a software engineer.</p>\n<p>I wanted a snapshot of my thoughts and impressions from this point in time. That way someday in the future I can look back at the naive, fresh-faced new engineer and laugh.</p>\n<h2>Impressions</h2>\n<p>The sheer breadth of knowledge required to operate as a full-stack engineer is staggering. Frontend, backend, infra. React, NEXT, Express, Travis, AWS. I felt like I had a decent working knowledge of all them but it was still overwhelming.</p>\n<p>Working from home has some downsides. The work day doesn't quite <em>start</em> or <em>end</em>. It's a challenge being able to walk away from incomplete work. It's like a video game, you don't want to quit until you solve it. I'm working on having a more rigid routine and office hours.</p>\n<h2>What I've learnt</h2>\n<h3>1. Infra</h3>\n<p>I thought I'd have a decent headstart having just picked up my AWS Certification. But holy shit working with production systems is really different. There no clean slate, you have to worry about downtime, migrations, snapshots. So much of the knowledge is implicit: how to search CloudWatch logs, configuring security groups and using jumphosts. I've gone from being super unsure of what I'm doing to just minor self-doubt, which is nice.</p>\n<h3>2. Working remote</h3>\n<p>Nothing like starting a new job in the middle of freaking pandemic to teach remote work. The importance of writing Pull Requests are magnified when you can't talk face to face with other people. Diagrams have been a real lifesaver, especially once i started using <a href=\"https://excalidraw.com/\">Excalidraw</a>.</p>\n<h3>3. Random bits of knowledge</h3>\n<p>Probably the greatest stuff I've picked up is all the casual tools and knowledge from other engineers. From VSCode extensions to Cloudflare's <a href=\"https://1.1.1.1/\">1.1.1.1 DNS</a>. About once a week I find something that improves my productivity / work flow.</p>\n"}},"__N_SSG":true}